Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: tm/Ibrahim_Compliance-level1.tmx
Source language: en_us
Languages: ja

source: Add a checklist item for source code publishing in the product release.
ja: 製品リリースにソース コード配布用のチェックリスト項目を追加する。

source: Toolchains used for development are treated equally to any other Package.
ja: 開発用に使用されるツールチェーンは、他のすべてのパッケージと同等に扱われます。

source: The mini-workshop will be offered on September 28, 2010 from 1:50 pm to 3:45 pm. Attendance will be limited to the first 20 who register.
ja: このミニワークショップの開催予定は、2010 年 9 月 28 日の午後 1:50 から 3:45 です。定員は 20 名ですので、お早めにお申し込みください。

source: Reviewing the compliance record by Legal, Engineering and the Compliance Officer
ja: リーガル、エンジニアリング、およびコンプライアンス オフィサーによるコンプライアンス記録をレビューする

source: This separation is vital because it allows the platform owner to decide which keys they trust without compromising the ability of the KEK controllers to assure themselves that the OS booted securely.
ja: このように分離することは極めて重要です。なぜなら、プラットフォーム オーナーは、鍵交換鍵の管理者の権能を脅かすことなく、信頼できる鍵を決定し、確実に OS を安全に起動できるからです。

source: Corporate code contributions
ja: 企業のコード貢献

source: The business environment is very predictable
ja: ビジネス環境は簡単に予測可能

source: Disclosureof open source use by third party suppliers
ja: サード パーティ サプライヤーによるオープン ソース使用の開示

source: - It accelerates exchange of information and ideas with the FOSS community through sharing of source code modifications
ja: 改変ソース コードの共有を通して、FOSS コミュニティとの情報/アイデア交換が促進される

source: Course Description
ja: コースの説明

source: Establishing an internal FOSS portal that will host the company's compliance policies and procedures, FOSS related publications and presentations, mailing lists, and a discussion forum related to FOSS and compliance.
ja: 社内ポータル: 会社のコンプライアンス ポリシーと手続き、関連する資料やプレゼンテーション、メーリング リスト、FOSS とコンプライアンスに関するディスカッション フォーラムなどを掲載する。

source: What is a Build System?
ja: ビルド システムとは何か

source: The priority of all companies is to ship the product on time while building and expanding their internal FOSS compliance infrastructure.
ja: すべての会社の最優先事項は、社内の FOSS コンプライアンス基盤を構築および拡張しつつ、予定通りに製品を出荷することです。

source: Depending on the size of the company and the extent to which FOSS is included in its commercial offerings, the company can mandate their employees working with FOSS to take formal instructor-led courses and pass the evaluation.
ja: 企業の規模や、商品にどの程度 FOSS が含まれるかにもよりますが、企業が FOSS に携わっている従業員に対し、インストラクター指導の公式なコースを受講して試験にパスするよう命じる場合があります。

source: Again, the developer must specify the packaging tools and the recipe on how the package is build including a manifest that contains meta information about the package.
ja: 繰り返しますが、開発者はパッケージング ツールと、そのパッケージのビルド方法のレシピ (パッケージに関するメタ情報が入ったマニフェストを含む) を指定する必要があります。

source: Local Build Environment
ja: ローカル ビルド環境

source: Once all pre-distribution verifications have been completed, the next step is to upload the FOSS
ja: 配布前の検証がすべて完了すると、次に、

source: The OSRB Legal representative interprets FOSS licenses and their obligations, and provides FOSS license advice to engineering and product teams.
ja: OSRB の法律顧問は、FOSS ライセンスとそれらの義務を分析し、エンジニアリング チームやプロダクト チームに FOSS ライセンスに関する助言を行います。

source: Testing, Quality Assurance, Configuration Management and Logistics
ja: 検査、品質管理、構成管理、および物流

source: On-Site Trainingis highly recommended to afford confidential and effective discussion of course material and its application to company practices.Instructor-led live remote training is also available.
ja: オンサイト トレーニングをお勧めしています。教材内容や実際のプラクティスへの応用について、機密事項も含めて効果的に議論することができるためです。インストラクターによるライブ リモート トレーニングも可能です。

source: Where the checklist highlights the need for additional work, organizations will benefit from training, benchmarking, and communicating with other companies about approaches to specific practices that have been demonstrated to be effective.
ja: チェックリストによって追加作業の必要性が明らかになった場合は、効果的であることが実証されているプラクティスを取り入れるべく、トレーニングやベンチマーキング、さらには他社とのコミュニケーションを試みることにより、効果が得られるでしょう。

source: About the Author
ja: 作者について

source: Getting the approval of the OSRB to include the specific software component in the product
ja: 製品に特定のソフトウェア コンポーネントを含めるために、OSRBの承認を得る

source: Supply Chain's supplier selection procedures are tailored to assure that OSS compliance requirements are considered when performing due diligence on suppliers.
ja: サプライ チェーンのサプライヤー選定手続きを手直しし、サプライヤーの精査を実行する際に、必ず OSS コンプライアンス要件が検討されるようにする。

source: The Linux Foundation offers a wide range of courses on Embedded Linux including:
ja: The Linux Foundation では、組込み Linux に関するさまざまなコースを提供しています。たとえば、以下のようなものがあります。

source: Dedicated assignments to the compliance function provide continuity of involvement and accumulation of expertise.
ja: コンプライアンスの職務に専任者を配置することにより、継続的な関与と専門知識の蓄積を行う。

source: An introduction to the MeeGo Build Infrastructure, Rudolf Streif, The Linux Foundation
ja: MeeGo ビルド基盤の紹介、Rudolf Streif, The Linux Foundation

source: Effective Compliance
ja: 効果的なコンプライアンス

source: Occasionally, these breakdowns in communication have escalated into public lawsuits.
ja: そして、このようなコミュニケーションの隔たりが、時には公的訴訟に発展します。

source: A staffing plan is prepared and followed to provide a level of responsiveness and cycle time adequate for product release cycles.
ja: 製品リリース サイクルに合致した応答レベルとサイクル タイムを提供できるように、要員配置計画を用意すること。

source: c)The compliance team verifies that source code to be made available corresponds exactly to the binaries in the product.
ja: c) コンプライアンス チームは、公開されるソース コードが、製品内のバイナリと正しく対応していることを検証する。

source: Includes LF281/LF384 content plus working sessions with the compliance team on how to adapt compliance activities to the organization’s needs.
ja: LF281 と LF384 の内容のほか、コンプライアンス活動を各組織のニーズにどう適応させるかに関するコンプライアンス チームとの討論もあり。

source: - All obligations related to the use of licensed material have been identified
ja: (商用) ライセンス品の使用に関するすべての義務が確認されていること

source: The Program can facilitate organizational discussions to assess compliance process maturity and can recommend practices for implementation.
ja: このプログラムは、コンプライアンス プロセスの成熟度を評価するための組織的な議論を促進し、改善に役立つ事例を推奨します。

source: Process Management
ja: プロセス管理

source: It helps to discover what components were used to create compiled code.
ja: コンパイル済みコードの作成に使用されたコンポーネントの検出に役立ちます。

source: Linux Foundation resources
ja: The Linux Foundation が提供するリソース

source: Compliance teams (core and extended)
ja: コンプライアンス チーム (コアおよび拡張)

source: Automatic quality checks for instance rpmlint, etc. can be integrated with the OBS workflow for instant validation after building.
ja: ビルド後の即時検証 (instant validaton) を行う OBS ワークフローに、インスタンスの品質を自動的にチェックする rpmlint などを統合します。

source: - Review and decide on the approval to release proprietary source code under a FOSS license
ja: FOSS ライセンスの下におけるプロプライエタリ ソース コードのリリースに関する承認のレビューと決定

source: Authentication and access control lists (ACL) provide the necessary security.
ja: 認証とアクセス管理リスト (ACL) により、必要なセキュリティが提供されます。

source: Audits determine whether the organization maintains accurate records about the OSS content of its products and of the compliance activities it performs.
ja: 監査は、その製品の OSS コンテンツと、組織が実行するコンプライアンス作業について、組織が正確な記録を保持しているかどうかを確認する。

source: OBS can build Projects and Packages for multiple platforms and architectures at the same time.
ja: OBS は、複数のプラットフォームやアーキテクチャに対応するプロジェクトやパッケージを同時にビルドできます。

source: Users can connect to it with a web browser.
ja: ユーザーは、Web ブラウザによりこれに接続できます。

source: Furthermore, companies need external compliance communications to ensure that the FOSS community is aware of their efforts to meet the license obligations of the FOSS they are using in their commercial product.
ja: また、企業は、自社商品で使用している FOSS のライセンス義務履行のための努力を確実に FOSS コミュニティに認識させるために、外部とコンプライアンス コミュニケーションをとる必要があります。

source: Source code review tool
ja: ソース コード レビュー ツール (Source code review tool)

source: Elements
ja: 項目

source: Getting SPDX(TM) adopted across the ecosystem will be a challenge.
ja: エコシステム全体に SPDX(TM) を浸透させるのは大変なことです。

source: Frequent builds either scheduled for instance nightly builds or triggered on every commit to a version control system.
ja: 高頻度なビルド。たとえば計画的な夜間ビルドや、バージョン管理システムへのコミットごとにトリガされるビルドなど。

source: Our number one goal in any GPL violation case is to get proper and full compliance with the license; everything else is secondary.
ja: GPL 違反問題の提起における我々の第一目的は、適切かつ完全にライセンスを順守してもらうことであり、それ以外は二の次です。

source: Proprietary + FOSS +
ja: プロプライエタリ + FOSS +

source: If you do not start with that high-level consensus, driving agreement on the details of the policy and investments in the process tends to be very hard if not impossible.
ja: 。社内のハイレベルの合意を得た上で開始しなければ、ポリシーの詳細部分やプロセスへの投資について合意に達するのは、不可能ではないにしても相当難しいでしょう。

source: File Type (source or binary)
ja: ファイル タイプ (ソースかバイナリか)

source: Maintaining compliance for evolving products
ja: 進化する製品においてもコンプライアンスを維持する

source: a)Compliance goals and objectives are set.
ja: a) コンプライアンスの達成目標が設定されている。

source: Types of Analysis
ja: 解析のタイプ

source: The goal of this specification is to enable companies and organizations to share license and component information (metadata) for software package and related content with the aim of facilitating license and other policy compliance.
ja: 企業や組織が、ソフトウェア パッケージと関連コンテンツのライセンスやコンポーネント情報 (メタデータ) を共有できるように、一連のデータ交換標準規格を作成することにより、ライセンスやその他のポリシー コンプライアンスを促進します。

source: The grass-roots effort includes representatives from more than 20 organizations - software, systems and tool vendors, foundations and systems integrators - all committed to creating a standard for software package data exchange(TM) formats.
ja: この草の根の取り組みにあたり、ソフトウェア/システム/ツール ベンダー、いろいろな標準化組織・財団、システム インテグレーターなど 20 を超える団体から、SPDX(TM) フォーマット作成への賛同が得られました。

source: For access to the SPDX SPEC and more information visit http://spdx.org or contact:
ja: SPDX の仕様書へのアクセス情報などは、http://spdx.org をご覧いただくか、下記の担当者までお問い合わせください。

source: Additional resources available from The Linux Foundation
ja: The Linux Foundation が提供するその他のリソース

source: The internal portal houses the compliance policies, guidelines, documentation, training, and hosts discussion forums, announcements, and access to mailing lists.
ja: 社内ポータルには、コンプライアンス ポリシー、ガイドライン、ドキュメンテーション、トレーニングなどが保存され、ディスカッション フォーラム、アナウンスメント、およびメーリング リストへのアクセスなどが用意されています。

source: To be notified when the tool becomes available, please click below.
ja: ツールが有効になった時に通知を希望する方は、次のボタンをクリックしてください。

source: For the purpose of this article, we do not discuss in detail the compliance process.
ja: このホワイトペーパーでは、コンプライアンス プロセスの詳細については考察しません。

source: Linux Foundation Resources
ja: Linux Foundation リソース

source: EXAMPLE OF INCREMENTAL COMPLIANCE
ja: インクリメンタル コンプライアンスの例

source: In addition, the course examines the benefits and risks of adopting FOSS and using it in commercial products and introduces compliance and license obligations.
ja: また、FOSS を採用したり、商品で使用したりする場合のメリットとリスクを検証し、コンプライアンスおよびライセンス義務の概要を教えます。

source: Breaking the problem down into its component pieces gives a sense of its scope:
ja: コンポーネント単位で考えることで、問題のスコープがはっきりします。

source: - Performing verification of all previous steps prior to distribution
ja: 以上の全ステップを配布前に検証する

source: - Auditing source code
ja: ソース コードを監査する

source: In the original SEI training, appraisers were taught to assess the following common features to determine whether an organization had met its capability goals:
ja: オリジナルの SEI トレーニングでは、組織がその capability goals を満たしたかどうかを決定するために、鑑定士は、次のような共通の機能を評価するように指導されました。

source: The cryptographic hash algorithm representing a unique identifier that correlates with a specific software package
ja: そのソフトウェア パッケージに関連付けられた一意の識別子を生成する暗号ハッシュ アルゴリズム

source: The localization team is responsible for translating the FOSS licenses and notices into the supported languages depending on the countries in which the product will be available.
ja: ローカリゼーション チームは、製品を提供する国に合わせて、FOSS のライセンスや告知の文書を各国語版に翻訳する責任を負います。

source: a)Audits identify the instances in which non-standard reviews were used.
ja: a) 監査は、基準外の手法を使用している事例を識別する。

source: Viewing Copyright/Email/URL Scan Results
ja: 著作権情報、電子メール アドレス、URL スキャン結果の表示

source: Learn Real-Time
ja: リアルタイムについて学ぶ

source: Although the FOSSology was started inside of Hewlett Packard for its own use, it is an open source project with developers both inside and outside of HP.
ja: FOSSology は Hewlett Packard が自社で使用するために始めたものですが、現在は、HP の社内外の開発者が参加するオープン ソース プロジェクトです。

source: Bill of Material Difference Tool (BoM Diff)
ja: BoM 比較ツール (Bill of Material Difference Tool, BoM Diff)

source: MeeGo and OBS Training
ja: MeeGo と OBS のトレーニング

source: Access source code via git: http://git.linuxfoundation.org/?p=janitor.git
ja: git でソース コードにアクセス: http://git.linuxfoundation.org/?p=janitor.git

source: Read a good book:
ja: お勧めの書籍としては、以下のようなものあります。

source: OBS users can build Packages and entire Projects locally on their own systems.
ja: OBS ユーザーは、各自のシステムで、パッケージとプロジェクト全体をローカルにビルドできます。

source: Corporate Development
ja: 経営企画

source: This file will not be rescanned even if it is loaded from more than one source.
ja: 同一内容のファイルは、異なる入力ソースから読み込まれても再スキャンされません。

source: OBS utilizes Projects to organize Packages into logical units.
ja: OBS は、プロジェクトを使用して、パッケージを論理単位に構成します。

source: The changing business environment moving to a multi-source development model
ja: マルチソース 開発モデルへのビジネス環境の移行

source: Other FOSS that the specific software component interacts with or depends on especially if it is governed by a different FOSS license
ja: 当該ソフトウェア コンポーネントが相互作用する、または依存する他の FOSS。特にそれが異なる FOSS ライセンスによって管理されている場合。

source: d)Procedures are established to assure that correct and complete versions of OSS are posted.
ja: d) 正確かつ完全な OSS のバージョンの掲載を保証するための手順が確立されている。

source: OBS Architecture
ja: OBS アーキテクチャ

source: Architectural dependency graphs
ja: 設計上の依存状態の図

source: The compliance team performs verification activities according to a defined procedure.
ja: コンプライアンス チームは、定義された手続きに従って、検証作業を実行する。

source: The compliance checklist explicitly recognizes valid alternative practices that may be used to achieve a particular goal.
ja: コンプライアンス チェックリストは、1 つの目的を達成するために利用できる有効な複数の代替手段を明確に評価します。

source: Verification that inappropriate comments have been removed from the source code packages.
ja: ソース コード パッケージから不適切なコメントが削除されていることの検証。

source: Managing the compliance program
ja: コンプライアンス プログラムの管理

source: One item of interest in Figure 6 is the Bitstream copyright.
ja: 図 6 に Bitstream という著作権情報が表示されています。

source: OBS provides integrated repository servers for sources and binaries.
ja: OBS は、ソースとバイナリ用の統合リポジトリ サーバーを提供します。

source: So where is SPDX(TM) now?
ja: SPDX(TM) は今どこにあるか？

source: Open source compliance program
ja: オープン ソース コンプライアンス プログラム

source: 23:59 GMT: Soft Freeze
ja: 23:59 (世界標準時): ソフト フリーズ

source: The Linux Foundation now offers comprehensive training on open source compliance from industry experts, along with tools, information, and guidance to assist organizations in achieving their compliance objectives.
ja: The Linux Foundation では、コンプライアンスの履行に務める組織を支援するために、各種のツール、情報、ガイダンスのほか、業界エキスパートによるオープン ソース コンプライアンスの包括的トレーニングを提供しています。

source: It is somewhat different from the traditional embedded approach where toolchains to build the software for a particular target are treated as external.
ja: この点では、特定ターゲット向けのソフトウェア構築用ツールチェーンを外部として扱っていた従来の組込みアプローチと少し異なります。

source: FOSS compliance means that users of FOSS must observe all the copyright notices and satisfy all the license obligations for the FOSS they use.
ja: FOSS コンプライアンスとは、FOSS のユーザーがすべての著作権表示を認め、各自が使用する FOSS のすべてのラ イセンス義務を果たすことを意味します。

source: The single most important recommendation with respect to messaging is to be clear and consistent in your messaging, whether it is internally explaining the company's goals and concerns around FOSS to your employees, or externally toward the FOSS community.
ja: メッセージングで最も重要なのは、たとえ社内で従業員向けに FOSS に関する企業の目的や懸念事項を説明する場合でも、外部の FOSS コミュニティに向けて発信する場合でも、常に明確に、自分のメッセージに一貫性を持たせることです。

source: - Identify possible matches with open source projects
ja: オープン ソース プロジェクトと一致していないかどうか確認する

source: Really, though, who cares about software package data exchange(TM) formats?
ja: SPDX(TM) フォーマットに関心があるのは誰でしょうか?

source: - Specific engineering situations that are applicable to FOSS compliance
ja: FOSS コンプライアンスに適用される特定のエンジニアリング条件

source: However, for the purpose of this paper, we will only focus on the compliance aspect and therefore call the person in this role a Compliance Officer.
ja: ただし、このペーパーでは、コンプライアンスの面に焦点を絞っていますので、この役割を持つ人物をコンプライアンス オフィサーと呼んでいます。

source: The MeeGo Community Build Service directly links to the MeeGo Build Service providing application developers direct read-only access to all projects and packages contained in the MeeGo Build Service.
ja: MeeGo Community Build Service は、MeeGo Build Service に直接リンクしており、アプリケーション開発者は、MeeGo Build Service に含まれるすべてのプロジェクトとパッケージの直接読み出しが可能です。

source: This exercise take places in collaboration with the OSRB and the Compliance Officer.
ja: この処理は、OSRB とコンプライアンス オフィサーとの協力によって行われます。

source: - Using previously approved FOSS in a different product
ja: 以前承認された FOSS を別の製品で使用する

source: Reproducible ?
ja: 再生可能であること

source: The OSRB hosts the FOSS internal and external web portals.
ja: OSRB は FOSS の社内向けおよび外部向けの Web ポータルを運営します。

source: Establishing Free and Open Source Software Compliance Programs: Challenges and Solutions
ja: フリー & オープン ソース ソフトウェア コンプライアンス プログラムの確立: 課題と解決策

source: However, we hope that this translation will help language speakers understand the GNU GPL better.
ja: However, we hope that this translation will help language speakers understand the GNU GPL better. (この翻訳文書が、language スピーカーによる GNU GPL 理解の一助になれば幸いです。)

source: The Linux Foundation has been supportive of this effort (that started at LinuxCon after all) since the work’s inception, but that connection has catapulted forward with the foundation’s Open Source Compliance Program.
ja: The Linux Foundation は、LinuxCon から開始されたこの取り組みを当初から支援してきましたが、The Linux Foundation のオープン ソース コンプライアンス プログラムによって、さらに連携が深まりました。

source: In addition to the Compliance Program elements described above, the Linux Foundation sponsors the FOSSBazaar community of open source compliance practitioners.
ja: LF では、上記のコンプライアンス プログラムのほか、オープン ソース コンプライアンス プラクティショナーである FOSSBazaar コミュニティへの支援も行っています。

source: Acronyms
ja: 頭字語

source: FOSS Compliance Extended Team
ja: FOSS コンプライアンス拡張チーム

source: Localization
ja: ローカリゼーション

source: The practices that follow are organized and presented according to the notion of core compliance processes and supporting elements, as illustrated below.
ja: この自己診断チェックリストに掲載されているプラクティスは、下図のような、コア コンプライアンス プロセスとサポート項目という概念に従って編成および提案されています。

source: That obviously does not imply that a target distribution built with OBS for an embedded system must include the toolchain as it is the case for any other software components that are required to build the system versus the components required to run the system.
ja: ◆これは、「組込みシステム向けに OBS でビルドされたターゲット ディストリビューションには、ツールチェーンが含まれているはずだ」という意味ではありません。「システムをビルドするために必要なソフトウェア コンポーネント」と、「システムを実行するために必要なコンポーネント」があるからです。◆

source: But as of the latest version (1.2) I consider the following to be limitations:
ja: しかし、最新バージョン (1.2) の時点では、次のような制約が考えられます。

source: - Review and approve the list of obligations to fulfill for each software component included in a product
ja: 製品に含まれる各ソフトウェア コンポーネントに対応する義務遂行リストのレビューと承認を行う

source: All discussions with companies about their compliance practices will protect confidential information.
ja: 自社のコンプライアンス事例を議論することは、機密情報の保護につながります。

source: This means that if only a binary package is scanned, you will only see the licenses that can be found in it.
ja: つまり、バイナリ パッケージだけをスキャンした場合、その中にあるライセンスしかわからない。

source: The reason is that verifying the translation is a difficult and expensive task and often involves the help of bilingual lawyers in other countries.
ja: 翻訳の検証が困難かつ高額な作業であり、他国のバイリンガルの法律家の助けを必要とすることが多いためです。

source: As a company that maintains rigid compliance practices, you should highlight your compliance program and practices, and show good faith efforts toward compliance.
ja: 常に厳格なコンプライアンス活動を行う企業として、自社のコンプライアンスの体制および活動を強調し、コンプライアンスへの誠実な取り組みを証明する必要があります。

source: This white paper is fifth in a series that focuses on the various practical aspects of ensuring free and open source software (FOSS) compliance in the enterprise.
ja: このホワイトペーパーは、企業におけるフリー & オープン ソース ソフトウェア (FOSS) のコンプライアンス (法令・契約などの順守) を履行する実務的側面に重点を置いたシリーズの第五弾です。

source: The Open Compliance Program’s goal is to help organizations plan improvements to their compliance process.
ja: オープン コンプライアンス プログラムの目的は、組織によるコンプライアンス プロセス改善計画を助けることです。

source: Purchasing / Supply Chain
ja: 購買 / サプライ チェーン

source: The biannual Embedded Linux Conference is hosted by The Linux Foundation and the CE Linux Workgroup and co-located with The Linux Foundation Collaboration Summit.
ja: 年に 2 回の Embedded Linux Conference は、The Linux Foundation と CE Linux ワークグループが共同主催するイベントで、The Linux Foundation Collaboration Summit と同会場で開催されます。

source: Continuous improvements of tools used in ensuring compliance and automating as many activities as possible to ensure high efficiency in executing the compliance program
ja: コンプライアンスの確認に使用するツールや、コンプライアンス プログラム実行時の効率を保証するために最大限の処理を自動化するツールの継続的な機能向上。

source: iv)Evaluation licenses are acquired or other mechanisms for experimenting with tools are used.
ja: iv) 評価ライセンスを取得している。あるいは、ツールを試すための別のメカニズムを使用していること。

source: Each FOSS must have a corresponding compliance ticket.
ja: 各 FOSS は、対応するコンプライアンス チケットを持つ必要があります。

source: The ingredients vary by step but are somewhat similar: tools for processing, input to be processed, and a recipe for processing.
ja: この成分はステップごとに異なりますが、共通しているのは、処理するためのツール、処理されるべき入力データ、および処理レシピの 3 つだということです。

source: OBS therefore provides a signer service to compute hashes and signatures for the binary packages.
ja: このため OBS は、バイナリ パッケージのハッシュと署名を算出するためのサイナー サービスを提供しています。

source: Review and approval of planned community contributions
ja: コミュニティ貢献計画に関する調査と承認

source: Tool acquisition or tool development projects are planned and executed according to defined procedures for tool development and adoption.
ja: ツール開発・導入のために定義された手続きに従って、ツール入手プロジェクト、またはツール開発プロジェクトが計画および実行されていること。

source: As a result, fostering self-delusion or ignoring process gaps accomplishes no good.
ja: 結果として自己欺瞞が生まれたり、プロセス ギャップが見逃されたりしては意味がありません。

source: Activities (the key practices used)
ja: 作業 (使用される主なプラクティス)

source: It is not sufficient to point at the supplier and inform the FOSS community that meeting FOSS license obligations is the responsibility of the supplier.
ja: サプライヤーを指し示し、FOSS ライセンス義務の履行はそのサプライヤーの責任であることを FOSS コミュニティに教えるだけでは不十分です。

source: This paper examines a sample end-to-end compliance process.
ja: ここでは、詳細なコンプライアンス プロセスの例を取り上げて説明します。

source: Failure to take the FOSS training:
ja: FOSS トレーニング不履行:

source: The design the UEFI committee came up with is elegantly outlined in section 27.5 of the specification, but can be summarized in terms of a two-key system.
ja: UEFI による設計については、この仕様書のセクション 27.5 で簡潔に説明されていますが、ここで、その two-key システムについて簡単に説明しましょう。

source: “Controlled” in this sense means that these keys are public/private key pairs; whoever knows the private key is the key controller, but to install the key, you only need the public piece, which means KEKs may be installed by anybody without controlling them.
ja: この「管理する (control)」とは、これらの鍵が公開鍵/秘密鍵のペアであり、秘密鍵を知っている人物がその鍵の管理者だということです。しかしその鍵をインストールするには公開鍵さえあればよいため、鍵交換鍵は、それらを管理していない人物でもインストールすることができます。

source: http://www.linuxfoundation.org/programs/legal/compliance.
ja: http://www.linuxfoundation.org/programs/legal/compliance (英語) http://www.linuxfoundation.jp/programs/legal/compliance (日本語)

source: If the OSRB rejects the use of the FOSS component, they communicate the reason for rejection to the requester and this information is recorded as part of the compliance ticket.
ja: OSRB は、FOSS コンポーネントの使用を承認しない場合は、申請者にその理由を説明し、この情報をコンプライアンス チケットに記録します。

source: The goal of linkage analysis is to find potentially problematic code combinations at the static and dynamic link level, such as linking a GPL library to a proprietary source code component.
ja: リンク解析の目的は、動的および静的リンク レベルで、問題発生の可能性のあるコードの組み合わせ (GPL ライブラリをプロプライエタリ ソース コード コンポーネントにリンクしているなど) を検出することです。
